Autodesk.Revit.DB.IndependentTag.GetTagBoxMiddlePoints
Calculates the midpoints of the four bounding box edges around the tag head.
These are the points to which the leader would attach to the tag head.
Returns:
The points order is East, West, North, and South.

Autodesk.Revit.DB.IndependentTag
Represents tag annotations in Revit.
getBBoxCorers in MultipleAlignmentHelper needs access to some protected members.
Remarks:
IndependentTag represents single-category tags, multi-category tags, material tags, and zone tags.
IndependentTag is also the base class for other annotations like keynote tags and span symbols.
Room, area and space tags are not derived from IndependentTag.  Autodesk.Revit.DB.SpatialElementTag for more information.